Revit 2024 API
TextNode.WidthScale Property
 Scale applied to the width of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double WidthScale { get; }
Visual Basic
Public ReadOnly Property WidthScale As Double
	Get
Visual C++
public:
property double WidthScale {
	double get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace